Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData.GetCurrentElements
Returns the list of Ids of the current elements.
Returns:
Ids of the current elements. Contains the analytical model element to which the code checking parameter belongs.
Since:
2014

Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData.Document
The current document.
Since:
2014

Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData
The data needed by code checking server to perform code checking.
Since:
2014